<?xml version="1.0"?>
<CastXML format="1.3.1">

    <Argument type="_402" location="f4:766" file="f4" line="766"/>
  </Function>
  <Function id="_697" name="mpfr_fmms" returns="_723" context="_1" location="f4:767" file="f4" line="767">
    <Argument type="_411" location="f4:767" file="f4" line="767"/>
    <Argument type="_412" location="f4:767" file="f4" line="767"/>
    <Argument type="_412" location="f4:767" file="f4" line="767"/>
    <Argument type="_412" location="f4:767" file="f4" line="767"/>
    <Argument type="_412" location="f4:768" file="f4" line="768"/>
    <Argument type="_402" location="f4:768" file="f4" line="768"/>
  </Function>
  <Function id="_698" name="mpfr_sum" returns="_723" context="_1" location="f4:769" file="f4" line="769">
    <Argument type="_411" location="f4:769" file="f4" line="769"/>
    <Argument type="_796" location="f4:769" file="f4" line="769"/>
    <Argument type="_722" location="f4:769" file="f4" line="769"/>
    <Argument type="_402" location="f4:770" file="f4" line="770"/>
  </Function>
  <Function id="_699" name="mpfr_dot" returns="_723" context="_1" location="f4:771" file="f4" line="771">
    <Argument type="_411" location="f4:771" file="f4" line="771"/>
    <Argument type="_796" location="f4:771" file="f4" line="771"/>
    <Argument type="_796" location="f4:771" file="f4" line="771"/>
    <Argument type="_722" location="f4:772" file="f4" line="772"/>
    <Argument type="_402" location="f4:772" file="f4" line="772"/>
  </Function>
  <Function id="_700" name="mpfr_free_cache" returns="_758" context="_1" location="f4:774" file="f4" line="774"/>
  <Function id="_701" name="mpfr_free_cache2" returns="_758" context="_1" location="f4:775" file="f4" line="775">
    <Argument type="_416" location="f4:775" file="f4" line="775"/>
  </Function>
  <Function id="_702" name="mpfr_free_pool" returns="_758" context="_1" location="f4:776" file="f4" line="776"/>
  <Function id="_703" name="mpfr_mp_memory_cleanup" returns="_723" context="_1" location="f4:777" file="f4" line="777"/>
  <Function id="_704" name="mpfr_subnormalize" returns="_723" context="_1" location="f4:779" file="f4" line="779">
    <Argument type="_411" location="f4:779" file="f4" line="779"/>
    <Argument type="_723" location="f4:779" file="f4" line="779"/>
    <Argument type="_402" location="f4:779" file="f4" line="779"/>
  </Function>
  <Function id="_705" name="mpfr_strtofr" returns="_723" context="_1" location="f4:781" file="f4" line="781">
    <Argument type="_411" location="f4:781" file="f4" line="781"/>
    <Argument type="_765" location="f4:781" file="f4" line="781"/>
    <Argument type="_768" location="f4:781" file="f4" line="781"/>
    <Argument type="_723" location="f4:781" file="f4" line="781"/>
    <Argument type="_402" location="f4:782" file="f4" line="782"/>
  </Function>
  <Function id="_706" name="mpfr_round_nearest_away_begin" returns="_758" context="_1" location="f4:784" file="f4" line="784">
    <Argument type="_788" original_type="_410" location="f4:784" file="f4" line="784"/>
  </Function>
  <Function id="_707" name="mpfr_round_nearest_away_end" returns="_723" context="_1" location="f4:785" file="f4" line="785">
    <Argument type="_788" original_type="_410" location="f4:785" file="f4" line="785"/>
    <Argument type="_723" location="f4:785" file="f4" line="785"/>
  </Function>
  <Function id="_708" name="mpfr_custom_get_size" returns="_8" context="_1" location="f4:787" file="f4" line="787">
    <Argument type="_403" location="f4:787" file="f4" line="787"/>
  </Function>
  <Function id="_709" name="mpfr_custom_init" returns="_758" context="_1" location="f4:788" file="f4" line="788">
    <Argument type="_769" location="f4:788" file="f4" line="788"/>
    <Argument type="_403" location="f4:788" file="f4" line="788"/>
  </Function>
  <Function id="_710" name="mpfr_custom_get_significand" returns="_769" context="_1" location="f4:790" file="f4" line="790">
    <Argument type="_412" location="f4:790" file="f4" line="790"/>
  </Function>
  <Function id="_711" name="mpfr_custom_get_exp" returns="_406" context="_1" location="f4:791" file="f4" line="791">
    <Argument type="_412" location="f4:791" file="f4" line="791"/>
  </Function>
  <Function id="_712" name="mpfr_custom_move" returns="_758" context="_1" location="f4:792" file="f4" line="792">
    <Argument type="_411" location="f4:792" file="f4" line="792"/>
    <Argument type="_769" location="f4:792" file="f4" line="792"/>
  </Function>
  <Function id="_713" name="mpfr_custom_init_set" returns="_758" context="_1" location="f4:793" file="f4" line="793">
    <Argument type="_411" location="f4:793" file="f4" line="793"/>
    <Argument type="_723" location="f4:793" file="f4" line="793"/>
    <Argument type="_406" location="f4:793" file="f4" line="793"/>
    <Argument type="_403" location="f4:794" file="f4" line="794"/>
    <Argument type="_769" location="f4:794" file="f4" line="794"/>
  </Function>
  <Function id="_714" name="mpfr_custom_get_kind" returns="_723" context="_1" location="f4:795" file="f4" line="795">
    <Argument type="_412" location="f4:795" file="f4" line="795"/>
  </Function>
  <Function id="_715" name="mpfr_total_order_p" returns="_723" context="_1" location="f4:797" file="f4" line="797">
    <Argument type="_412" location="f4:797" file="f4" line="797"/>
    <Argument type="_412" location="f4:797" file="f4" line="797"/>
  </Function>
  <FundamentalType id="_716" name="__int128" size="128" align="128"/>
  <FundamentalType id="_717" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_718" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_797 _798 _799 _800" size="256" align="64"/>
  <PointerType id="_719" type="_801" size="64" align="64"/>
  <ArrayType id="_720" min="0" max="0" type="_802"/>
  <FundamentalType id="_721" name="long int" size="64" align="64"/>
  <FundamentalType id="_722" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_723" name="int" size="32" align="32"/>
  <CvQualifiedType id="_723c" type="_723" const="1"/>
  <Field id="_724" name="__clang_max_align_nonce1" type="_803" context="_10" access="public" location="f2:20" file="f2" line="20" offset="0"/>
  <Field id="_725" name="__clang_max_align_nonce2" type="_793" context="_10" access="public" location="f2:22" file="f2" line="22" offset="128"/>
  <ElaboratedType id="_726" type="_10"/>
  <Field id="_727" name="_mp_alloc" type="_723" context="_15" access="public" location="f3:152" file="f3" line="152" offset="0"/>
  <Field id="_728" name="_mp_size" type="_723" context="_15" access="public" location="f3:154" file="f3" line="154" offset="32"/>
  <Field id="_729" name="_mp_d" type="_732" context="_15" access="public" location="f3:157" file="f3" line="157" offset="64"/>
  <ElaboratedType id="_730" type="_15"/>
  <ArrayType id="_731" min="0" max="0" type="_16"/>
  <PointerType id="_732" type="_12" size="64" align="64"/>
  <PointerType id="_733" type="_12c" size="64" align="64"/>
  <CvQualifiedType id="_12c" type="_12" const="1"/>
  <Field id="_734" name="_mp_num" type="_16" context="_23" access="public" location="f3:181" file="f3" line="181" offset="0"/>
  <Field id="_735" name="_mp_den" type="_16" context="_23" access="public" location="f3:182" file="f3" line="182" offset="128"/>
  <ElaboratedType id="_736" type="_23"/>
  <ArrayType id="_737" min="0" max="0" type="_24"/>
  <Field id="_738" name="_mp_prec" type="_723" context="_27" access="public" location="f3:190" file="f3" line="190" offset="0"/>
  <Field id="_739" name="_mp_size" type="_723" context="_27" access="public" location="f3:194" file="f3" line="194" offset="32"/>
  <Field id="_740" name="_mp_exp" type="_22" context="_27" access="public" location="f3:197" file="f3" line="197" offset="64"/>
  <Field id="_741" name="_mp_d" type="_732" context="_27" access="public" location="f3:198" file="f3" line="198" offset="128"/>
  <ElaboratedType id="_742" type="_27"/>
  <ArrayType id="_743" min="0" max="0" type="_28"/>
  <FundamentalType id="_744" name="unsigned int" size="32" align="32"/>
  <ElaboratedType id="_745" type="_30"/>
  <Field id="_746" name="_mp_seed" type="_18" context="_32" access="public" location="f3:214" file="f3" line="214" offset="0"/>
  <Field id="_747" name="_mp_alg" type="_31" context="_32" access="public" location="f3:215" file="f3" line="215" offset="128"/>
  <Union id="_748" name="" context="_32" location="f3:216" file="f3" line="216" members="_804" size="64" align="64"/>
  <Field id="_749" name="_mp_algdata" type="_805" context="_32" access="public" location="f3:218" file="f3" line="218" offset="192"/>
  <ElaboratedType id="_750" type="_32"/>
  <ArrayType id="_751" min="0" max="0" type="_33"/>
  <PointerType id="_752" type="_16c" size="64" align="64"/>
  <CvQualifiedType id="_16c" type="_16" const="1"/>
  <PointerType id="_753" type="_16" size="64" align="64"/>
  <PointerType id="_754" type="_28c" size="64" align="64"/>
  <CvQualifiedType id="_28c" type="_28" const="1"/>
  <PointerType id="_755" type="_28" size="64" align="64"/>
  <PointerType id="_756" type="_24c" size="64" align="64"/>
  <CvQualifiedType id="_24c" type="_24" const="1"/>
  <PointerType id="_757" type="_24" size="64" align="64"/>
  <FundamentalType id="_758" name="void" size="0" align="8"/>
  <PointerType id="_759" type="_806" size="64" align="64"/>
  <PointerType id="_760" type="_807" size="64" align="64"/>
  <PointerType id="_761" type="_808" size="64" align="64"/>
  <PointerType id="_762" type="_759" size="64" align="64"/>
  <PointerType id="_763" type="_760" size="64" align="64"/>
  <PointerType id="_764" type="_761" size="64" align="64"/>
  <PointerType id="_765" type="_801c" size="64" align="64"/>
  <CvQualifiedType id="_765c" type="_765" const="1"/>
  <PointerType id="_766" type="_33" size="64" align="64"/>
  <PointerType id="_767" type="_33c" size="64" align="64"/>
  <CvQualifiedType id="_33c" type="_33" const="1"/>
  <PointerType id="_768" type="_719" size="64" align="64"/>
  <PointerType id="_769" type="_758" size="64" align="64"/>
  <FundamentalType id="_770" name="double" size="64" align="64"/>
  <PointerType id="_771" type="_8" size="64" align="64"/>
  <PointerType id="_772" type="_721" size="64" align="64"/>
  <PointerType id="_773" type="_758c" size="64" align="64"/>
  <CvQualifiedType id="_758c" type="_758" const="1"/>
  <PointerType id="_774" type="_22" size="64" align="64"/>
  <PointerType id="_775" type="_13" size="64" align="64"/>
  <PointerType id="_776" type="_21" size="64" align="64"/>
  <PointerType id="_777" type="_809" size="64" align="64"/>
  <PointerType id="_778" type="_809c" size="64" align="64"/>
  <PointerType id="_779" type="_12v" size="64" align="64"/>
  <CvQualifiedType id="_12v" type="_12" volatile="1"/>
  <PointerType id="_780" type="_12cv" size="64" align="64"/>
  <CvQualifiedType id="_12cv" type="_12" const="1" volatile="1"/>
  <ElaboratedType id="_781" type="_401"/>
  <Field id="_782" name="_mpfr_prec" type="_403" context="_408" access="public" location="f4:225" file="f4" line="225" offset="0"/>
  <Field id="_783" name="_mpfr_sign" type="_405" context="_408" access="public" location="f4:226" file="f4" line="226" offset="64"/>
  <Field id="_784" name="_mpfr_exp" type="_406" context="_408" access="public" location="f4:227" file="f4" line="227" offset="128"/>
  <Field id="_785" name="_mpfr_d" type="_732" context="_408" access="public" location="f4:228" file="f4" line="228" offset="192"/>
  <ElaboratedType id="_786" type="_408"/>
  <ArrayType id="_787" min="0" max="0" type="_409"/>
  <PointerType id="_788" type="_409" size="64" align="64"/>
  <PointerType id="_789" type="_409c" size="64" align="64"/>
  <CvQualifiedType id="_409c" type="_409" const="1"/>
  <ElaboratedType id="_790" type="_413"/>
  <ElaboratedType id="_791" type="_415"/>
  <FundamentalType id="_792" name="float" size="32" align="32"/>
  <FundamentalType id="_793" name="long double" size="128" align="128"/>
  <PointerType id="_794" type="_406" size="64" align="64"/>
  <PointerType id="_795" type="_723" size="64" align="64"/>
  <PointerType id="_796" type="_411c" size="64" align="64"/>
  <CvQualifiedType id="_411c" type="_411" const="1"/>
  <Field id="_797" name="isa" type="_810" context="_718" access="public" offset="0"/>
  <Field id="_798" name="flags" type="_723" context="_718" access="public" offset="64"/>
  <Field id="_799" name="str" type="_765" context="_718" access="public" offset="128"/>
  <Field id="_800" name="length" type="_721" context="_718" access="public" offset="192"/>
  <CvQualifiedType id="_801c" type="_801" const="1"/>
  <Struct id="_802" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_811 _812 _813 _814" size="192" align="64"/>
  <FundamentalType id="_803" name="long long int" size="64" align="64"/>
  <Field id="_804" name="_mp_lc" type="_769" context="_748" access="public" location="f3:217" file="f3" line="217" offset="0"/>
  <ElaboratedType id="_805" type="_748"/>
  <CvQualifiedType id="_809c" type="_809" const="1"/>
  <PointerType id="_810" type="_723c" size="64" align="64"/>
  <Field id="_811" name="gp_offset" type="_744" context="_802" access="public" offset="0"/>
  <Field id="_812" name="fp_offset" type="_744" context="_802" access="public" offset="32"/>
  <Field id="_813" name="overflow_arg_area" type="_769" context="_802" access="public" offset="64"/>
  <Field id="_814" name="reg_save_area" type="_769" context="_802" access="public" offset="128"/>
  <FundamentalType id="_801" name="char" size="8" align="8"/>
  <FunctionType id="_806" returns="_769">
    <Argument type="_8"/>
  </FunctionType>
  <FunctionType id="_807" returns="_769">
    <Argument type="_769"/>
    <Argument type="_8"/>
    <Argument type="_8"/>
  </FunctionType>
  <FunctionType id="_808" returns="_758">
    <Argument type="_769"/>
    <Argument type="_8"/>
  </FunctionType>
  <FundamentalType id="_809" name="unsigned char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/nix/store/hzj61xzxf09jp8mn0x8cb29aq1paf33w-clang-14.0.6-lib/lib/clang/14.0.6/include/stddef.h"/>
  <File id="f2" name="/nix/store/hzj61xzxf09jp8mn0x8cb29aq1paf33w-clang-14.0.6-lib/lib/clang/14.0.6/include/__stddef_max_align_t.h"/>
  <File id="f3" name="/nix/store/1556dg51742f3jvhm289x4i50g52ppq8-gmp-6.1.2-dev/include/gmp.h"/>
  <File id="f4" name="mpfr.h"/>
</CastXML>
